const button = document.querySelector('.burger-menu');
const burgerNav = document.querySelector('.burger-nav');
const body = document.querySelector('body');
const navItems = document.querySelectorAll('.burger-nav__list > li > a');
const linkItem = document.querySelectorAll('.burger-nav__list > li > a[href^="#"');
const topOffset = document.querySelector('.header').offsetHeight;

if (button) {
  button.addEventListener('click', function (e) {
    button.classList.toggle('active');
    burgerNav.classList.toggle('active');
    body.classList.toggle('block');
  });
}

navItems.forEach(i => {
  i.addEventListener('click', function (e) {
    button.classList.remove('active');
    burgerNav.classList.remove('active');
    body.classList.remove('block');
  });
});

linkItem.forEach(l => {
  l.addEventListener('click', function (e) {
    e.preventDefault();
    let href = this.getAttribute('href').substring(1);
    const scrollTarget = document.getElementById(href);
    const elementPosition = scrollTarget.getBoundingClientRect().top;
    const offsetPosition = elementPosition - topOffset;
    window.scrollBy({
      top: offsetPosition,
      behavior: 'smooth'
    });
  });
});


console.log('1. вёрстка валидная + 10 \n Для проверки валидности вёрстки HTML использован сервис https: //validator.w3.org/ Надпись Document checking completed. No errors or warnings to show. \n Для проверки валидности вёрстки CSS использован сервис https: //jigsaw.w3.org/css-validator/ Надпись Поздравляем! Ошибок не обнаружено. \n 2. вёрстка семантическая + 20\ n В коде страницы присутствуют семантические теги HTML5, например, article, aside, figure, figcaption, footer, header, main, nav, section, используются заголовки h1 - h6.Заголовок h1 может быть только один 2 балла за каждый уникальный семантический тег HTML5 и за каждый уникальный заголовок h1 - h6, но не больше 20 баллов \n');
для оформления СV используются css - стили + 10 1 балл за каждый стилизованный элемент, но не больше 10 баллов контент размещается в блоке, который горизонтально центрируется на странице.Фоновый цвет, если он есть, тянется во всю ширину страницы + 10 вёрстка адаптивная: ни на одном из разрешений экрана до 320 px включительно не появляется горизонтальная полоса прокрутки, при этом всё содержание страницы сохраняется + 10 есть адаптивное бургер - меню.Ссылки в пунктах меню ведут на основные разделы CV.При кликах по пунктам меню реализована плавная прокрутка по якорям.При уменьшении ширины экрана меню становится адаптивным.Внешний вид адаптивного меню можно скопировать с макета музея + 10 на странице СV присутствует изображение - фото или аватарка автора CV, пропорции изображения не искажены, у изображения есть атрибут alt(может быть пустым) + 10 контакты для связи и перечень навыков оформлены в виде списка ul > li + 10 CV содержит контакты для связи, краткую информацию о себе, перечень навыков, информацию об образовании и уровне английского + 10 CV содержит пример вашего кода(например, решение задачи с сайта codewars) с подсветкой кода.Для подсветки кода может использоваться js - библиотека, например, highlight.js + 10 CV содержит изображения - ссылки на выполненные вами проекты.При клике по изображению страница проекта открывается в новой вкладке.У каждого проекта есть название, небольшое описание, указан перечень используемых технологий. + 10 CV выполнено на английском языке + 10 выполнены требования к Pull Request: есть ссылка на задание, скриншот страницы СV, ссылка на деплой страницы CV на GitHub Pages, выполнена самооценка(самооценку расписываем по пунктам критериев оценки, указывая балл за каждый пункт) + 10 Вниманию проверяющих.Так как сабмитится ссылка на деплой CV, вам необходимо будет самостоятельно найти Pull Request для проверки.Для этого по ссылке в футере перейдите на гитхаб автора CV, найдите там репозиторий rsschool - cv, в нём открытый PR из ветки cv - html - css в ветку main с названием CV и проверьте его описание.есть видеорезюме автора CV на английском языке.Видеорезюме встраивается в страницу CV как видео, а не в виде кнопки или ссылки.Продолжительность видео 3 - 5 минут(±15 секунд).В описание видео на YouTube добавлена ссылка на его транскрипцию на английском языке(например, в документе Google Docs). + 10 Вниманию авторов работы.Убедитесь, что видео проигрывается и ссылка на транскрипцию открывается в режиме инкогнито браузера.дизайн, оформление, качество выполнения CV не ниже чем в примерах CV, приведённых в материалах к заданию(это дополнительные 10 баллов, поэтому некоторый субъективизм в оценке может присутствовать) + 10;